In [3]:
import csv
import os
import pandas as pd
# print(os.getcwd())

df = pd.read_csv("salary_dataset.csv")
df.head() # gets first 5 rows

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type
0,1,Employee_1,58,Female,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time
1,2,Employee_2,48,Female,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time
2,3,Employee_3,34,Male,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time
3,4,Employee_4,27,Male,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract
4,5,Employee_5,40,Male,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time

Pandas couldn't read my csv file, so i had to get the current working directory(cwd) to make sure i am in the right path. Though it didn't work, so i just closed vs code and opened it again which now worked.

In [ ]:
# save/automatically to/create a new csv file without index
df.to_csv("new_salary_dataset.csv", index=False)

In [ ]:
# import sys
# sys.executable # to check current python interpreter
%pip install openpyxl # % symbol indicates to install on current python environment/interpreter

In [5]:
# read excel file
df = pd.read_excel("salary_dataset.xlsx")
df.head()

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type
0,1,Employee_1,58,Female,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time
1,2,Employee_2,48,Female,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time
2,3,Employee_3,34,Male,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time
3,4,Employee_4,27,Male,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract
4,5,Employee_5,40,Male,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time

alright i had issues trying to read an excel file but what i did was to install openpyxl for readig excel files. i had also had i issues trying to pip install with ! (cmd symbol) bc it was installing in a different python interpreter so i had to use % (symbol for installing in current interpreter) which now worked

In [ ]:
# to read csv with selected columns
pd.read_csv("salary_dataset.csv", usecols=["Age", "Salary_USD"])

# read csv and handle missing values
pd.read_csv("salary_dataset.csv", na_values=["?", "NA", "missing"])

# read only first 5 rows
pd.read_csv("salary_dataset.csv", nrows=5)

# read excel specific sheet
pd.read_excel("salary_dataset.xlsx", sheet_name="test_dataset")

name     0
age      0
score    3
dtype: int64

In [ ]:
# Challenge

# load csv
df = pd.read_csv("students.csv")
print(display(df))

# print first 3 rows
# pd.read_csv("students.csv", nrows=3)
df.head(3) # smarter way

# check number of missing values
df.isna().sum()

# select only age and score
pd.read_csv("students.csv", usecols=["age", "score"])

# # remove rows where score is missing
# df = df.dropna()

# # save cleaned data as new csv file
# df.to_csv("students_clean.csv", index=False)

# fill missing values with the mean of entire score column
df.fillna("missing")
df["score"] = df["score"].fillna(df["score"].mean())
df.round(1)

      name  age  score
0    Alice   22   85.0
1      Bob   20    NaN
2  Charlie   21   92.0
3    Diana   23   78.0
4      Eve   19   95.0
5    Frank   24    NaN
6    Grace   22   88.0
7    Henry   20   76.0
8      Ivy   21   91.0
9     Jack   23    NaN

None

      name  age  score
0    Alice   22   85.0
1      Bob   20   86.4
2  Charlie   21   92.0
3    Diana   23   78.0
4      Eve   19   95.0
5    Frank   24   86.4
6    Grace   22   88.0
7    Henry   20   76.0
8      Ivy   21   91.0
9     Jack   23   86.4

the full meaning of csv is comma-separated values

In [ ]:
# homework
# load csv file
df = pd.read_csv("weather.csv")
print(df)

# add a new column
df["temp_f"] = df["temp"] * 1.8 + 32
df

# save clean data
df.to_csv("weather_clean.csv", index=False)

# reload the saved file
df_reload = pd.read_csv("weather_clean.csv")

print("Reloaded from wather_clean.csv:")
df_reload

            city  temp
0          Lagos    30
1          Abuja    28
2  Port Harcourt    31
3           Kano    25
4         Ibadan    29
5          Enugu    27
Reloaded from wather_clean.csv:

            city  temp  temp_f
0          Lagos    30    86.0
1          Abuja    28    82.4
2  Port Harcourt    31    87.8
3           Kano    25    77.0
4         Ibadan    29    84.2
5          Enugu    27    80.6

In [11]:
# 100 days of python

# with open("weather_data.csv") as f:
#     data = f.readlines()
    # print(data)

# with open("weather_data.csv") as data_file:
#     data = csv.reader(data_file)
#     temperatures = []
#     for row in data:
#         if row[1] != "temp":
#             temperatures.append(int(row[1]))
#     print(temperatures)

df = pd.read_csv("weather_data.csv")
df["temp"]

0    12
1    14
2    15
3    14
4    21
5    22
6    24
Name: temp, dtype: int64